import pandas as pd
import pytest


@pytest.fixture
def dict_transactions():
    return [
        {"Описание":"Константин Л."},
        {"Описание":"Дмитрий Ш."}
    ]


@pytest.fixture
def operation_data():
    """Пример тестовых данных"""
    data = {
        "Дата операции": [
                          "19.11.2021 18:54:29",
                          "19.11.2021 10:05:18",
                          "18.11.2021 15:11:38",
                          "22.08.2021 17:56:09",
                          "20.08.2021 14:33:05"],
        "Дата платежа":[
                        "19.11.2021",
                        "19.11.2021",
                        "18.11.2021",
                        "22.08.2021",
                        "20.08.2021"],
        "Номер карты":[
                        "*5091",
                        "*7197",
                        "*5091",
                        "*7197",
                        "*7197"],
        "Статус":[
                        "OK",
                        "OK",
                        "OK",
                        "OK",
                        "FAILED"],
        "Категория":[
                        "Супермаркет",
                        "Супермаркет",
                        "Супермаркет",
                        "Транспорт",
                        "Транспорт"],
        "Сумма":[
                        339.90,
                        1620.27,
                        392.26,
                        234,
                        300]
    }

    df=pd.DataFrame(data)
    return df


@pytest.fixture
def sample_transaction():
    return pd.DataFrame({"Номер карты":["*1112", "*5091"], "Сумма платежа":[-100, -200]})

